In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [33]:
import configparser
# get data from configuration file
config = configparser.ConfigParser()
try:
    config.read('ETLDemo.ini')
except Exception as e:
    print('could not read configuration file:' + str(e))
    sys.exit()

In [34]:
# read settings from configuration file
server = config['CONFIG']['server']
database = config['CONFIG']['database']
user = config['CONFIG']['user']
password = config['CONFIG']['password']

In [35]:
import psycopg2
#engine = create_engine('postgresql://test_user1:abc123@localhost:5432/test_db1')
engine = create_engine('postgresql://' + user + ':' + password + '@' + server + ':5432/' + database)

In [3]:
test_cases_df = pd.read_csv('test_cases.csv')

In [4]:
test_cases_df

   trans_key  Field_1  Field_2  Field_3  Result_value
0        101    100.0     45.0     72.0         237.0
1        102    200.0     20.0     41.0         443.5
2        105    333.2     55.6     88.9         123.8
3        106    111.0    444.0    333.0         888.0

In [16]:
test_cases_df = test_cases_df.set_index('trans_key')
test_cases_df

           Field_1  Field_2  Field_3  Result_value
trans_key
101          100.0     45.0     72.0         237.0
102          200.0     20.0     41.0         443.5
105          333.2     55.6     88.9         123.8
106          111.0    444.0    333.0         888.0

In [36]:
# Connect to PostgreSQL server

dbConnection    = engine.connect();

In [42]:
results_df       = pd.read_sql("select * from dummy_results", dbConnection);

In [43]:
results_df

   trans_key  result_value
0        101        237.00
1        102        123.45
2        103        445.22
3        104        500.22

In [44]:
results_df = results_df.rename(columns={'result_value': 'computed_value'})

In [45]:
results_df = results_df.set_index('trans_key')
results_df

           computed_value
trans_key
101                237.00
102                123.45
103                445.22
104                500.22

In [18]:
combined_df = pd.concat([test_cases_df, results_df], axis=1)

In [19]:
combined_df

           Field_1  Field_2  Field_3  Result_value  computed_value
trans_key
101          100.0     45.0     72.0         237.0          237.00
102          200.0     20.0     41.0         443.5          123.45
103            NaN      NaN      NaN           NaN          445.22
104            NaN      NaN      NaN           NaN          500.22
105          333.2     55.6     88.9         123.8             NaN
106          111.0    444.0    333.0         888.0             NaN

In [46]:
test_cases_df.join(results_df)

           Field_1  Field_2  Field_3  Result_value  computed_value
trans_key
101          100.0     45.0     72.0         237.0          237.00
102          200.0     20.0     41.0         443.5          123.45
105          333.2     55.6     88.9         123.8             NaN
106          111.0    444.0    333.0         888.0             NaN